import React from 'react';
import { Link, useParams } from 'react-router-dom';
import '../App.css';

const newsData = [
  { 
    id: 1, 
    title: 'Нов метод за подобряване на ударите', 
    content: 'Тенисен експерт представи нов метод за трениране, който обещава да подобри ударите на играчите. Този иновативен подход използва съчетание от нови технологии и анализ на движенията, което може да доведе до значително подобрение в техниката и ефективността на играчите.'
  },
  { 
    id: 2, 
    title: 'Нов треньор в тенис клуб "Чемпион"', 
    content: 'Тенис клуб "Чемпион" обяви новото си попълнение в треньорския щаб. Известният треньор Янко Типсаревич ще бъде на разположение на играчите, като се очаква да допринесе със своя опит и знания за развитието на талантливите тенисисти.'
  },
  { 
    id: 3, 
    title: 'Тенис турнирът в Париж започва следващата седмица', 
    content: 'Един от най-очакваните тенис турнири на сезона започва следващата седмица в Париж. Световните тенис звезди вече са на подготовка за този голям спортен събитие, където ще се състезават за престижната титла и големите награди.'
  },
  { 
    id: 4, 
    title: 'Известен играч оттегля участието си от следващия голям турнир', 
    content: 'Един от водещите играчи в света на тениса обяви, че оттегля участието си от предстоящия голям турнир поради здравословни проблеми. Това въздействие ще остави голямо празнота в състезанието, но също така отваря врати за нови предизвикателства за другите играчи.'
  },
  { 
    id: 5, 
    title: 'Нов клубен състезателен сезон стартира с много предизвикателства', 
    content: 'Клубният състезателен сезон стартира с много предизвикателства за тенис клубовете по целия свят. Този сезон обещава много вълнуващи мачове и състезания, които ще привлекат вниманието на феновете и ще тестват уменията на играчите.'
  },
  { 
    id: 6, 
    title: 'Тенис звездата назначена за лице на новата рекламна кампания', 
    content: 'Една от най-популярните тенис звезди беше назначена за лице на новата рекламна кампания на световноизвестна марка. Това партньорство обещава да бъде взаимно изгодно и да представи играча пред нова публика.'
  },
  { 
    id: 7, 
    title: 'Нов треньорски екип в "Тенис Академия"', 
    content: 'Тенис Академия обяви новия си треньорски екип, който ще работи с младите тенисисти в клуба. Този екип включва опитни треньори и ментори, които ще помагат на талантливите играчи в тяхната подготовка и развитие.'
  },
  { 
    id: 8, 
    title: 'Млад талант открит на международен юношески турнир', 
    content: 'Млад талант в света на тениса беше открит на последния международен юношески турнир. Този играч показа впечатляващи умения и потенциал за развитие, което го прави един от водещите кандидати за бъдещите тенис звезди.'
  },
  { 
    id: 9, 
    title: 'Тенис легенда отново на корта след здравословни проблеми', 
    content: 'Една от най-великите тенис легенди обяви, че е готова да се завърне на корта след продължителен период на възстановяване от здравословни проблеми. Феновете с нетърпение очакват да видят този голям играч да се върне в играта и да продължи да впечатлява със своите умения.'
  },
  { 
    id: 10, 
    title: 'Изненадващи резултати на професионален турнир', 
    content: 'Последният професионален тенис турнир беше пълен с изненади и неочаквани резултати. Много от фаворитите не успяха да достигнат до финала, като това даде възможност на нови и неочаквани имена да се изкачат на върха.'
  }
];

const NewsDetails = () => {
  let { id } = useParams();

  const newsItem = newsData.find(item => item.id === parseInt(id));

  return (
    <div className="news-details-container">
      <h2>{newsItem.title}</h2>
      <p>{newsItem.content}</p>
      <Link to="/news" className="back-button">Назад</Link>
    </div>
  );
}

export default NewsDetails;